[
  {
    "project_name": "Gasket for ME360",
    "image_folder_path": "ME360_gasket/",
    "image_files": ["gasket-drawing.jpg","gasket-assembly.jpg"],
    "inProgress": false,
    "dates": "Jan 2023",
    "info": {
      "tags": ["SolidWorks", "CAD", "CAM", "GibbsCam", "Measuement"],
      "description": {
        "brief": "This gasket was the product of an assignment for a course at Boston University, Electromechanical Design.",
        "verbose": ["This project was an excercize in measurement and design.  We were given a metal part with locating pins and holes of varying geomentry and tasked with producing a gasket which would match it to 0.005\" of an inch.", "First, I took measuements with the caliper set provided, and recorded them on a rough sketch.  From this, I created a Solidworks CAD file with the relevant part geometry.  To attain the ideal fits, I used a chart of ANSI standards as a sizing guide.  To produce the gasket, we were provided 1/32\" thick PVC stock.  I created a CAM file from the CAD using GibbsCAM.  Because of the flexibility of PVC, I included an extra toolpath offset and a spring pass.  We were also instructed to include an extra 0.003\" all around, which I was hesitant to include, as it may have been redundant to the offsets I had already considered.  The machined part was slightly oversized, which I attribute to this.  Out of curiosity, I remade the part without the extra 0.003\" and it fit perfectly."]
      }
    },
    "links": [
      {
        "source": "Related CAD, CAM, and image Files",
        "url": "https://drive.google.com/drive/folders/1fpWwhp8ZB6UEoqHbCn-4dvcjxxiQwDuY?usp=sharing"
      }
    ]
  },
  {
    "project_name": "Worlds Largest Kid-Powered Stomp Rocket",
    "image_folder_path": "chitag_rocket/",
    "image_files": ["chitagRocketStageSetup.jpg", "handlebarGuardCAM.jpg"],
    "inProgress": false,
    "dates": "January 2019 to November 2019",
    "info": {
      "tags": [
        "SolidWorks",
        "CAD",
        "CAM",
        "SolidCam",
        "Pneumatics",
        "Lathe",
        "Mill",
        "Smooth-On",
        "3D Printing"
      ],
      "description": {
        "brief": "An 8-foot tall foam rocket used as an attraction at the Chicago Toy and Game Fair.",
        "verbose": [
          "Participants jumped on stomp pads to build air pressure and press a button to launch the rocket.",
          "Mechanism: Jumping on a stomp pad compresses a foot-powered bicycle pump connected to the launcher.  This resets the launcher piston, sealing off the tank.  A check valve allows pressure to equalize in both chambers as pressure builds from the four stomp pads.  Once the desired pressure is achieved, pushing a red button allows air to escape from the stomp pad side, causing the piston to slide back.  The piston movement compresses a spring until a hard stop is hit and the seal is broken almost instantaneously.  The explosive force from the tank launches the rocket."
        ]
      }
    },
    "links": [
      {
        "source": "Video: Prototype 50 psi test launch",
        "url": "https://youtu.be/9N14jaQVq4c"
      },
      {
        "source": "Video: Awards ceremony launch on Kite and Rocket Website",
        "url": "https://kiteandrocket.com/krvideo/worlds-largest-kid-powered-rocket/"
      }
    ]
  },
  {
    "project_name": "Vacuum Splint",
    "image_folder_path": "",
    "image_files": ["vacuumsplint.jpg"],
    "inProgress": false,
    "dates": "April 2021 to July 2021",
    "info": {
      "tags": [
        "casting",
        "3D Printing",
        "FDM",
        "Rotocasting",
        "Smooth-On",
        "SolidWorks",
        "CAD",
        "Lathe",
        "Mill"
      ],
      "description": {
        "brief": "This device addresses the symptoms of Peyronie's disease which is caused by scar tissue formation on the penis.",
        "verbose": [
          "The project was proposed by a doctor in the field who believed that the current solutions were bulky and ineffective.  I came up with a modularized mechanical solution to the problem inspired by the splint I used when I broke my hand.",
          "The design consists of a foam pad which puts pressure on the bend and can be adjusted by thumbscrew.  The housing was FDM 3D printed.  To maintain the required vacuum seal, I turned multiple segments of polycarbonate tube which could be stacked together and interface with the vacuum pump.  By request, I started another prototype for a balloon-style pressure mechanism.  To manufature the balloon, I tried to rotocast urethane with a mechanism I built, but could not achieve a consitent wall thickness.  My final mold design before leaving the project required a polyurethane melt-away core (expensive, I know), but we found the inflation to be difficult to control, inconsistent, and potentialy dangerous.  The client ultimately agreed that a mechanical screw mechanism would be the preferred choice."
        ]
      }
    },
    "links": [
      {
        "source": "Video: Demo of screw mechanism prototype",
        "url": "https://youtube.com/shorts/PqT1VKvN9DI?feature=share"
      }
    ]
  },
  {
    "project_name": "Kite and Rocket Wordpress Theme",
    "image_folder_path": "",
    "image_files": ["kiteandrocketDesktopScreenshot.png"],
    "inProgress": false,
    "dates": "Aug 2020 to Jul 2021",
    "info": {
      "tags": [
        "PHP",
        "Wordpress",
        "Blade",
        "jquery",
        "javascript",
        "html+css",
        "wistia"
      ],
      "description": {
        "brief": "This project entailed the complete teardown and reconstruction of the Kite and Rocket website.",
        "verbose": [
          "Having never used wordpress or PHP before, I was tasked with digging through the source code and figuring out how everything worked under the hood.  In addition to cleaning up layers of overwritten code, updating packages, and redesigning the UI, I implemented mobile-responsive breakpoints, a touchscreen-friendly swipeable carousel, video sharing functionality, amongst other improvements.  I also improved upon the wordpress dashboard interface and created a custom wordpress post type plugin.  In the main directory I left a readme file with careful documentation and usage instructions for the next webmaster.  Note: the website in its current state may not accurately reflect the last version I worked on."
        ]
      }
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/anyakeller/k-and-r-revamp"
      },
      {
        "source": "Kite and Rocket Live Website",
        "url": "http://kiteandrocket.com/"
      }
    ]
  },
  {
    "project_name": "Star Trek Themed Word Guessing Game",
    "image_folder_path": "",
    "image_files": ["hangmanScreenshot.png"],
    "inProgress": false,
    "dates": "Sep 2019",
    "info": {
      "tags": ["jquery", "javascript", "html+css"],
      "description": {
        "brief": "It's hangman. With Star Trek.",
        "verbose": ["Whoop dee doo."]
      }
    },
    "links": [
      {
        "source": "github",
        "url": "https://anyakeller.github.io/word_guess_game/"
      }
    ]
  },
  {
    "project_name": "Magic Music Matcher",
    "image_folder_path": "",
    "image_files": ["magicMusicMatcherScreenshot.png"],
    "inProgress": false,
    "dates": "Jan 2017",
    "info": {
      "tags": ["python", "flask", "jquery", "javascript", "html+css"],
      "description": {
        "brief": "Web application utilizing python flask for song generation.",
        "verbose": [
          "Features include an interactive selection map that generates songs from a random other country with similar charachteristics, a song search bar for doing the same with a specific song, a login system with saving songs to your profile,and an embedded spotify player."
        ]
      }
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/Bayless/The-Chosen-Tarsiers"
      }
    ]
  },
  {
    "project_name": "Auto-Balancing Binary Search Tree",
    "image_folder_path": "",
    "image_files": ["BSTscreenshot.png"],
    "inProgress": false,
    "info": {
      "tags": ["java"],
      "description": {
        "brief": "A vizualizer for binary search trees written in Java that will automatically sort a random array of numbers and produce a balanced tree.",
        "verbose": [""]
      },
      "demo_ins": "Run visualizer with $java VisualTree Run sorting algo with $java BST"
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/anyakeller/BST_FP"
      }
    ]
  },
  {
    "project_name": "Tile Puzzle",
    "image_folder_path": "",
    "image_files": ["tilePuzzleScreenshot.png"],
    "inProgress": false,
    "info": {
      "tags": ["java"],
      "description": {
        "brief": "A 3 by 3 sliding tile puzzle game built using Java. Clickable tiles allow sliding to complete the picture. Two sorting algorithms are available to solve the puzzle move by move.",
        "verbose": [""]
      },
      "demo_ins": "Compile files using javac and run $java PuzzleWindow to play and $java Puzzle to see the algorithm in action"
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/st234pa/TilePuzzle2"
      }
    ]
  }
]
