[
  {
    "project_name": "Worlds Largest Kid-Powered Stomp Rocket",
    "img_file": "chitagRocketStageSetup.jpg",
    "inProgress": false,
    "dates":"January 2019 to November 2019",
    "info": {
      "tags": ["SolidWorks", "CAD", "CAM", "SolidCam", "Pneumatics", "Lathe", "Mill", "Smooth-On", "3D Printing"],
      "description": "An 8-foot tall foam rocket used as an attraction at the Chicago Toy and Game Fair.  Participants jump on stomp pads to build air pressure and press a button to launch the rocket.  Mechanism: Jumping on a stomp pad compresses a foot-powered bicycle pump connected to the launcher.  This resets the launcher piston, sealing off the tank.  A check valve allows pressure to equalize in both chambers as pressure builds from the four stomp pads.  Once the desired pressure is achieved, pushing a red button allows air to escape from the stomp pad side, causing the piston to slide back.  The piston movement compresses a spring until a hard stop is hit and the seal is broken almost instantaneously.  The explosive force from the tank launches the rocket."
    },
    "links": [
      {
        "source": "Video of awards ceremony launch on Kite and Rocket Website",
        "url": "https://kiteandrocket.com/krvideo/worlds-largest-kid-powered-rocket/"
      }
    ]
  },
  {
    "project_name": "Kite and Rocket Wordpress Theme",
    "img_file": "kiteandrocketDesktopScreenshot.png",
    "inProgress": false,
    "dates":"Aug 2020 to Jul 2021",
    "info": {
      "tags": ["PHP", "Wordpress", "Blade", "jquery", "javascript", "html+css", "wistia"],
      "description": "This project was the complete teardown and reconstruction of the Kite and Rocket website.  Having never used wordpress or PHP before, I was tasked with digging through the source code and figuring out how everything worked under the hood.  In addition to cleaning up layers of overwritten code, updating packages, and redesigning the UI, I implemented mobile-responsive breakpoints, a touchscreen-friendly swipable carousel, video sharing functionality, amongst other improvements.  I also imporved upon the wordpress dashboard interface and created a custom worpress post type plugin.  In the main directory I left a readme file with carful documentation and usage instructions for the next webmaster.  Note: the wesbite in its current state may not accurately reflect the last version I worked on."
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/anyakeller/k-and-r-revamp"
      },
      {
        "source": "Kite and Rocket Live Website",
        "url": "http://kiteandrocket.com/"
      }
    ]
  },
  {
    "project_name": "Star Trek Themed Word Guessing Game",
    "img_file": "hangmanScreenshot.png",
    "inProgress": false,
    "dates": "Sep 2019",
    "info": {
      "tags": ["jquery", "javascript", "html+css"],
      "description": "It's hangman. With Star Trek.  Whoop dee doo"
    },
    "links": [
      {
        "source": "github",
        "url": "https://anyakeller.github.io/word_guess_game/"
      }
    ]
  },
  {
    "project_name": "Magic Music Matcher",
    "img_file": "magicMusicMatcherScreenshot.png",
    "inProgress": false,
    "dates":"Jan 2017",
    "info": {
      "tags": ["python", "flask", "jquery", "javascript", "html+css"],
      "description": "Web application utilizing python flask for song generation.  Features include an interactive selection map that generates songs from a random other country with similar charachteristics, a song search bar for doing the same with a specific song, a login system with saving songs to your profile,and an embedded spotify player."
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/Bayless/The-Chosen-Tarsiers"
      }
    ]
  },
  {
    "project_name": "Auto-Balancing Binary Search Tree",
    "img_file": "BSTscreenshot.png",
    "inProgress": false,
    "info": {
      "tags": ["java"],
      "description": "A vizualizer for binary search trees written in Java that will automatically sort a random array of numbers and produce a balanced tree.",
      "demo_ins": "Run visualizer with $java VisualTree Run sorting algo with $java BST"
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/anyakeller/BST_FP"
      }
    ]
  },
  {
    "project_name": "Tile Puzzle",
    "img_file": "tilePuzzleScreenshot.png",
    "inProgress": false,
    "info": {
      "tags": ["java"],
      "description": "A 3 by 3 sliding tile puzzle game built using Java. Clickable tiles allow sliding to complete the picture. Two sorting algorithms are available to solve the puzzle move by move.",
      "demo_ins": "Compile files using javac and run $java PuzzleWindow to play and $java Puzzle to see the algorithm in action"
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/st234pa/TilePuzzle2"
      }
    ]
  }
]
