[
  {
    "project_name": "Worlds Largest Kid-Powered Stomp Rocket",
    "img_file": "chitagRocketStageSetup.jpg",
    "inProgress": false,
    "dates":"January 2019 to November 2019",
    "info": {
      "tags": ["SolidWorks", "CAD", "CAM", "SolidCam", "Pneumatics", "Lathe", "Mill", "Smooth-On", "3D Printing"],
      "description": "An 8-foot tall foam rocket used as an attraction at the Chicago Toy and Game Fair.  Participants jump on stomp pads to build air pressure and press a button to launch the rocket.  Mechanism: Jumping on a stomp pad compresses a foot-powered bicycle pump connected to the launcher.  This resets the launcher piston, sealing off the tank.  A check valve allows pressure to equalize in both chambers as pressure builds from the four stomp pads.  Once the desired pressure is achieved, pushing a red button allows air to escape from the stomp pad side, causing the piston to slide back.  The piston movement compresses a spring until a hard stop is hit and the seal is broken almost instantaneously.  The explosive force from the tank launches the rocket."
    },
    "links": [
      {
        "source": "Video: Prototype 50 psi test launch",
        "url": "https://youtu.be/9N14jaQVq4c"
      },
      {
        "source": "Video: Awards ceremony launch on Kite and Rocket Website",
        "url": "https://kiteandrocket.com/krvideo/worlds-largest-kid-powered-rocket/"
      }
    ]
  },
  {
    "project_name": "Vacuum Splint",
    "img_file": "vacuumsplint.jpg",
    "inProgress": false,
    "dates":"April 2021 to July 2021",
    "info": {
      "tags": ["Rotocasting", "Smooth-On", "casting","3D Printing", "FDM", "SolidWorks", "CAD", "Lathe", "Mill"],
      "description": "This device addresses the symptoms of Peyronie's disease which is caused by scar formation on the penis.  The scar tissue creates exaggerated bends in the tissue and can be extremely painful.  The project was proposed by a doctor in the field who believed that the current solutions were bulky and ineffective.  I came up with a modularized mechanical solution to the problem inspired by the splint I used when I broke my hand.  The design consists of a foam pad which puts pressure on the bend and can be adjusted by thumbscrew.  The housing was FDM 3D printed.  To maintain the required vacuum seal, I turned multiple segments of polycarbonate tube which could be stacked together and interface with the vacuum pump.  By request, before leaving the project, I started another prototype which used a polyurethane melt-away core cast balloon-style pressure mechanism, but found the inflation to be difficult to control, inconsistent, and potentialy dangerous."
    },
    "links": [
      {
        "source": "Video: Demo of screw mechanism prototype",
        "url": "https://youtube.com/shorts/PqT1VKvN9DI?feature=share"
      }
    ]
  },
  {
    "project_name": "Kite and Rocket Wordpress Theme",
    "img_file": "kiteandrocketDesktopScreenshot.png",
    "inProgress": false,
    "dates":"Aug 2020 to Jul 2021",
    "info": {
      "tags": ["PHP", "Wordpress", "Blade", "jquery", "javascript", "html+css", "wistia"],
      "description": "This project was the complete teardown and reconstruction of the Kite and Rocket website.  Having never used wordpress or PHP before, I was tasked with digging through the source code and figuring out how everything worked under the hood.  In addition to cleaning up layers of overwritten code, updating packages, and redesigning the UI, I implemented mobile-responsive breakpoints, a touchscreen-friendly swipeable carousel, video sharing functionality, amongst other improvements.  I also improved upon the wordpress dashboard interface and created a custom wordpress post type plugin.  In the main directory I left a readme file with careful documentation and usage instructions for the next webmaster.  Note: the website in its current state may not accurately reflect the last version I worked on."
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/anyakeller/k-and-r-revamp"
      },
      {
        "source": "Kite and Rocket Live Website",
        "url": "http://kiteandrocket.com/"
      }
    ]
  },
  {
    "project_name": "Star Trek Themed Word Guessing Game",
    "img_file": "hangmanScreenshot.png",
    "inProgress": false,
    "dates": "Sep 2019",
    "info": {
      "tags": ["jquery", "javascript", "html+css"],
      "description": "It's hangman. With Star Trek.  Whoop dee doo"
    },
    "links": [
      {
        "source": "github",
        "url": "https://anyakeller.github.io/word_guess_game/"
      }
    ]
  },
  {
    "project_name": "Magic Music Matcher",
    "img_file": "magicMusicMatcherScreenshot.png",
    "inProgress": false,
    "dates":"Jan 2017",
    "info": {
      "tags": ["python", "flask", "jquery", "javascript", "html+css"],
      "description": "Web application utilizing python flask for song generation.  Features include an interactive selection map that generates songs from a random other country with similar charachteristics, a song search bar for doing the same with a specific song, a login system with saving songs to your profile,and an embedded spotify player."
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/Bayless/The-Chosen-Tarsiers"
      }
    ]
  },
  {
    "project_name": "Auto-Balancing Binary Search Tree",
    "img_file": "BSTscreenshot.png",
    "inProgress": false,
    "info": {
      "tags": ["java"],
      "description": "A vizualizer for binary search trees written in Java that will automatically sort a random array of numbers and produce a balanced tree.",
      "demo_ins": "Run visualizer with $java VisualTree Run sorting algo with $java BST"
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/anyakeller/BST_FP"
      }
    ]
  },
  {
    "project_name": "Tile Puzzle",
    "img_file": "tilePuzzleScreenshot.png",
    "inProgress": false,
    "info": {
      "tags": ["java"],
      "description": "A 3 by 3 sliding tile puzzle game built using Java. Clickable tiles allow sliding to complete the picture. Two sorting algorithms are available to solve the puzzle move by move.",
      "demo_ins": "Compile files using javac and run $java PuzzleWindow to play and $java Puzzle to see the algorithm in action"
    },
    "links": [
      {
        "source": "github",
        "url": "https://github.com/st234pa/TilePuzzle2"
      }
    ]
  }
]
